sdaiAccessModelBN(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,SdaiAccessMode)
\details
Opens a specified model in a specified mode. The model is specified by its repository and name.
\param repository [in] A repository that owns the model. The function searches the model in this repository by the name.
\param modelName  [in] A model name.
\param mode       [in] An open mode.
\returns A pointer to the open model if the function successfully opens the model; otherwise, the function returns the NULL value.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NEXS - Transaction does not exist.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiRP_NEXS - Repository does not exist.
* sdaiMO_NEXS - SDAI-model does not exist.
* sdaiMX_RO - SDAI-model access read-only.
* sdaiMX_RW - SDAI-model access read-write.
* sdaiVT_NVLD - Name value type is invalid.
* sdaiSY_ERR - Underlying system error.
\code
SdaiSession session = sdaiOpenSession();
SdaiRep repo = sdaiOpenRepositoryBN(session, "test_repository");
SdaiModel model = sdaiCreateModelBN(repo, "default", "ifc4");
...
model = sdaiAccessModelBN(repo, "default", sdaiRW);
...
SdaiAppInstance ifcCircleProfileDef = sdaiCreateInstanceBN(model, "ifccircleprofiledef");